<!--
◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️
### COMPONENT JS (w/ TS)                                                               ◼️
### NOTE:                                                                              ◼️
### access custom Betarena Scores JS VScode Snippets by typing 'script...'             ◼️
◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️
-->

<script lang="ts">

  // #region ➤ 📦 Package Imports

  // ### ◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️
  // ### NOTE:                                                            ◼️
  // ### Please add inside 'this' region the 'imports' that are required  ◼️
  // ### by 'this' .svelte file is ran.                                   ◼️
  // ### IMPORTANT                                                        ◼️
  // ### Please, structure the imports as follows:                        ◼️
  // ### 1. svelte/sveltekit imports                                      ◼️
  // ### 2. project-internal files and logic                              ◼️
  // ### 3. component import(s)                                           ◼️
  // ### 4. assets import(s)                                              ◼️
  // ### 5. type(s) imports(s)                                            ◼️
  // ### ◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️

  import { page } from "$app/stores";

  import type { B_PROF_T } from "@betarena/scores-lib/types/profile.js";

  // #endregion ➤ 📦 Package Imports

  // #region ➤ 📌 VARIABLES

  // ### ◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️
  // ### NOTE:                                                            ◼️
  // ### Please add inside 'this' region the 'variables' that are to be   ◼️
  // ### and are expected to be used by 'this' .svelte file / component.  ◼️
  // ### IMPORTANT                                                        ◼️
  // ### Please, structure the imports as follows:                        ◼️
  // ### 1. export const / let [..]                                       ◼️
  // ### 2. const [..]                                                    ◼️
  // ### 3. let [..]                                                      ◼️
  // ### 4. $: [..]                                                       ◼️
  // ### ◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️

  const
    /** @description 📌 `this` component **main** `id` and `data-testid` prefix. */
    CNAME = 'profile⮕w⮕investor-title⮕main'
  ;

  let
    /** @description Profile Translation data. */
    B_PROF_T: B_PROF_T
  ;

  $: B_PROF_T = $page.data?.RESPONSE_PROFILE_DATA;

  // #endregion ➤ 📌 VARIABLES

</script>

<!--
◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️
### COMPONENT HTML                                                                     ◼️
### NOTE:                                                                              ◼️
### use 'CTRL+SPACE' to autocomplete global class=styles                               ◼️
### NOTE:                                                                              ◼️
### access custom Betarena Scores VScode Snippets by typing emmet-like abbrev.         ◼️
◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️
-->

<!--
▓ NOTE:
▓ > Launchpad main info.
-->
<div
  id={CNAME}
  class=
  "
  m-b-30
  "
>

  <!--
  ▓ NOTE:
  ▓ > Launchpad views.
  -->
  <div
    id="launchpad-view-box"
    class=
    "
    m-b-30
    width-fit-content
    "
  >

    <!--
    ▓ NOTE:
    ▓ > Private Presale box.
    -->
    <div
      class=
      "
      view-opt-box
      "
      class:activeOpt={true}
    >

      <p
        class=
        "
        s-16
        color-white
        no-wrap
        "
        class:color-white={true}
        class:w-500={true}
      >
        {B_PROF_T?.investor?.tab?.tab_1 ?? 'Private Presale'}
      </p>

    </div>

    <!--
    ▓ NOTE:
    ▓ > Public Presale box.
    -->
    <div
      class=
      "
      view-opt-box
      m-r-24
      "
      class:activeOpt={false}
    >

      <p
        class=
        "
        s-16
        color-grey-shade
        opacity-0-4
        no-wrap
        "
      >
        {B_PROF_T?.investor?.tab?.tab_1 ?? 'Public Presale (Soon)'}
      </p>

    </div>

  </div>

  <!--
  ▓ NOTE:
  ▓ > Bottom line.
  -->
  <div
    id="launchpad-bottom-box"
  />

  <!--
  ▓ NOTE:
  ▓ > Launchpad box.
  -->
  <div>

    <!--
    ▓ NOTE:
    ▓ > Launchpad title.
    -->
    <p
      class=
      "
      s-32
      color-white
      w-500
      m-b-16
      "
    >
      {B_PROF_T?.investor?.tab?.title_launchpad ?? 'Launchpad'}
    </p>

    <!--
    ▓ NOTE:
    ▓ > Launchpad description.
    -->
    <p
      id="launchpad-description"
      class=
      "
      s-16
      color-grey-shade
      "
    >
      {@html B_PROF_T?.investor?.tab?.description_launchpad ?? ''}
    </p>

  </div>

</div>

<!--
◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️
### COMPONENT STYLE                                                                    ◼️
### NOTE:                                                                              ◼️
### auto-fill/auto-complete iniside <style> for var() values by typing/CTRL+SPACE      ◼️
### NOTE:                                                                              ◼️
### access custom Betarena Scores CSS VScode Snippets by typing 'style...'             ◼️
◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️
-->

<style>

  div#profile⮕w⮕investor-title⮕main
  {
    /* 📌 position */
    position: relative;
    /* 🎨 style */
    margin-top: 12px;
  }

  div#launchpad-view-box
  {
    /* 📌 position */
    position: relative;
    /* 🎨 style */
    display: grid;
    gap: 25px;
    grid-auto-flow: column;
  }

  div#launchpad-bottom-box
  {
    /* 📌 position */
    position: absolute;
    top: 38px;
    right: 0;
    left: 0;
    /* 🎨 style */
    background-color: var(--dark-theme-1);
    height: 1px;
    width: 100%;
  }

  div#profile⮕w⮕investor-title⮕main div.view-opt-box
  {
    /* 🎨 style */
    border-bottom: solid 2.5px transparent;
    width: 100%;
    text-align: center;
  }
  div#profile⮕w⮕investor-title⮕main div.view-opt-box p
  {
    /* 🎨 style */
    padding-bottom: 12px;
  }
  div#profile⮕w⮕investor-title⮕main div.view-opt-box.activeOpt
  {
    /* 🎨 style */
    border-color: #f5620f;
  }

  :global(
    span#id_1
  )
  {
    /* 🎨 style */
    font-weight: 500;
    color: var(--white);
  }

  /*
  ◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️
  ◼️ ⚡️ RESPONSIVNESS      ◼️
  ◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️
  */

	@media only screen
  and (min-width: 769px)
  {

		div#profile⮕w⮕investor-title⮕main
    {
      /* 🎨 style */
		  margin-top: 0;
		}

    p#launchpad-description
    {
      /* 🎨 style */
      max-width: 393px;
    }

	}

</style>