// ╭──────────────────────────────────────────────────────────────────────────────────╮
// │ 📌 High Order Overview                                                           │
// ┣──────────────────────────────────────────────────────────────────────────────────┫
// │ ➤ Code Format   // V.8.0                                                         │
// │ ➤ Status        // 🔒 LOCKED                                                     │
// │ ➤ Author(s)     // @<author>                                                     │
// │ ➤ Maintainer(s) // @<author>                                                     │
// │ ➤ Created on    // <date-created>                                                │
// ┣──────────────────────────────────────────────────────────────────────────────────┫
// │ 📝 Description                                                                   │
// ┣──────────────────────────────────────────────────────────────────────────────────┫
// │ BETARENA (Module)
// │ |: <insert-module-summary-here>
// ╰──────────────────────────────────────────────────────────────────────────────────╯

// #region ➤ 📦 Package Imports

import { tryCatchAsync } from "@betarena/scores-lib/dist/util/common.js";
import { log_v3 } from "./debug.js";

// #endregion ➤ 📦 Package Imports

export class ServiceFacebook
{
  // ╭──────────────────────────────────────────────────────────────────────────────────╮
  // │ 📌 │ VARIABLE(S)                                                                 │
  // ╰──────────────────────────────────────────────────────────────────────────────────╯

  /**
   * @description
   * 📝 Singleton instance.
   */
  static _instance: any;

  /**
   * @description
   * 📝 Intercom 'is-ready' flag (ie: exists in 'window' global object)
   */
  isReady: boolean = false;

  // ╭──────────────────────────────────────────────────────────────────────────────────╮
  // │ 💠 │ CONSTRUCTOR                                                                 │
  // ╰──────────────────────────────────────────────────────────────────────────────────╯

  constructor ()
  {
    if (ServiceFacebook._instance)
      return ServiceFacebook._instance;
    ;

    this.checkStatus();

    ServiceFacebook._instance = this;
  }

  // ╭──────────────────────────────────────────────────────────────────────────────────╮
  // │ 📌 │ HELPER METHODS                                                              │
  // ╰──────────────────────────────────────────────────────────────────────────────────╯

  /**
   * @author
   *  @migbash
   * @summary
   *  🔹 HELPER
   * @description
   *  📝 Check Intercom status
   * @return { void }
   */
  checkStatus
  (
  ): void
  {
    tryCatchAsync
    (
      () =>
      {
        if (window == undefined)
          return;
        ;

        let
          // ╭─────
          // │ NOTE:
          // │ |:
          // ╰─────
          [
            isReady,
          ] = [
            false,
          ]
        ;

        isReady =
        (
          typeof window.fbq === "function"
        );

        if
        (
          this.isReady !== isReady
        )
          // [🐞]
          log_v3
          (
            {
              strGroupName: 'Service: Facebook // Check Status // Status Changed',
              msgs:
              [
                `isReady » ${isReady}`,
              ]
            },
          );
        ;

        this.isReady = isReady;

        return;

       }
    );

    return;
  }
}