<!--
╭──────────────────────────────────────────────────────────────────────────────────╮
│ Svelte Component JS/TS                                                           │
┣──────────────────────────────────────────────────────────────────────────────────┫
│ - access custom Betarena Scores JS VScode Snippets by typing 'script...'         │
╰──────────────────────────────────────────────────────────────────────────────────╯
-->

<script lang="ts">

  // #region ➤ 📦 Package Imports

  // ╭────────────────────────────────────────────────────────────────────────╮
  // │ NOTE:                                                                  │
  // │ Please add inside 'this' region the 'imports' that are required        │
  // │ by 'this' .svelte file is ran.                                         │
  // │ IMPORTANT                                                              │
  // │ Please, structure the imports as follows:                              │
  // │ 1. svelte/sveltekit imports                                            │
  // │ 2. project-internal files and logic                                    │
  // │ 3. component import(s)                                                 │
  // │ 4. assets import(s)                                                    │
  // │ 5. type(s) imports(s)                                                  │
  // ╰────────────────────────────────────────────────────────────────────────╯

  import { onMount } from 'svelte';

  import { config } from '$lib/constants/config.js';
  import Layout from '$lib/svelte/page/layout.root.svelte';

  // #endregion ➤ 📦 Package Imports

  // #region ➤ 🔄 LIFECYCLE [SVELTE]

  // ╭────────────────────────────────────────────────────────────────────────╮
  // │ NOTE:                                                                  │
  // │ Please add inside 'this' region the 'logic' that should run            │
  // │ immediately and as part of the 'lifecycle' of svelteJs,                │
  // │ as soon as 'this' .svelte file is ran.                                 │
  // ╰────────────────────────────────────────────────────────────────────────╯

  let _LayoutDynamic;

  onMount
  (
    async (
    ) =>
    {
      if (config.objApp.listLazyLoadComponents.get('src/routes/+layout.svelte')?.isDynamicImport)
        _LayoutDynamic
          = (
            await import
            (
              '$lib/svelte/page/layout.root.svelte'
            )
          ).default
        ;
      ;
    }
  );

  // #endregion ➤ 🔄 LIFECYCLE [SVELTE]

</script>

<!--
╭──────────────────────────────────────────────────────────────────────────────────╮
│ Svelte Component HTML                                                            │
┣──────────────────────────────────────────────────────────────────────────────────┫
│ - use 'Ctrl+Space' to autocomplete global class=styles                           │
│ - access custom Betarena Scores VScode Snippets by typing emmet-like abbrev.     │
╰──────────────────────────────────────────────────────────────────────────────────╯
-->

{#if !config.objApp.listLazyLoadComponents.get('src/routes/+layout.svelte')?.isHidden}

  {#if config.objApp.listLazyLoadComponents.get('src/routes/+layout.svelte')?.isDynamicImport}
    <svelte:component
      this={_LayoutDynamic}
    >
      <slot />
    </svelte:component>
  {:else}
    <Layout>
      <slot />
    </Layout>
  {/if}

{/if}
