<!--
╭──────────────────────────────────────────────────────────────────────────────────╮
│ 🟦 Svelte Component JS/TS                                                        │
┣──────────────────────────────────────────────────────────────────────────────────┫
│ ➤ HINT: │ Access snippets for '<script> [..] </script>' those found in           │
	import VisaIcon from './../../../ui/assets/VisaIcon.svelte';
│         │ '.vscode/snippets.code-snippets' via intellisense using 'doc'          │
╰──────────────────────────────────────────────────────────────────────────────────╯
-->

<script lang="ts">
  // #region ➤ 📦 Package Imports

  // ╭────────────────────────────────────────────────────────────────────────╮
  // │ NOTE:                                                                  │
  // │ Please add inside 'this' region the 'imports' that are required        │
  // │ by 'this' .svelte file is ran.                                         │
  // │ IMPORTANT                                                              │
  // │ Please, structure the imports as follows:                              │
  // │ 1. svelte/sveltekit imports                                            │
  // │ 2. project-internal files and logic                                    │
  // │ 3. component import(s)                                                 │
  // │ 4. assets import(s)                                                    │
  // │ 5. type(s) imports(s)                                                  │
  // ╰────────────────────────────────────────────────────────────────────────╯
  import session from "$lib/store/session";
  import { depositStore } from "./deposit-store";
  // #endregion ➤ 📦 Package Imports

  // #region ➤ 📌 VARIABLES

  // ╭────────────────────────────────────────────────────────────────────────╮
  // │ NOTE:                                                                  │
  // │ Please add inside 'this' region the 'variables' that are to be         │
  // │ and are expected to be used by 'this' .svelte file / component.        │
  // │ IMPORTANT                                                              │
  // │ Please, structure the imports as follows:                              │
  // │ 1. export const / let [..]                                             │
  // │ 2. const [..]                                                          │
  // │ 3. let [..]                                                            │
  // │ 4. $: [..]                                                             │
  // ╰────────────────────────────────────────────────────────────────────────╯
  export let buttonDisabled;

  $: ({ viewportType } = $session);

  buttonDisabled = false;

  // #endregion ➤ 📌 VARIABLES
</script>

<!--
╭──────────────────────────────────────────────────────────────────────────────────╮
│ 💠 Svelte Component HTML                                                         │
┣──────────────────────────────────────────────────────────────────────────────────┫
│ ➤ HINT: │ Use 'Ctrl + Space' to autocomplete global class=styles, dynamically    │
│         │ imported from './static/app.css'                                       │
│ ➤ HINT: │ access custom Betarena Scores VScode Snippets by typing emmet-like     │
│         │ abbrev.                                                                │
╰──────────────────────────────────────────────────────────────────────────────────╯
-->

<div class="deposit-proccessor-wrapper {viewportType}">
  <div class="header">
    <div class="title">Pay with Revolut</div>
  </div>
  <div class="data-wrapper">
    <div class="data">
      <div class="data-field">
        <div class="label">Amount</div>
        <div class="data-value">${$depositStore.amount}</div>
      </div>
      {#if $depositStore.rate}
        <div class="data-field">
          <div class="label">Estimated BTA</div>
          <div class="data-value">
            {(
              Number($depositStore.amount) * Number($depositStore.rate)
            ).toFixed(6)}
          </div>
        </div>
      {/if}
      <div class="data-field">
        <div class="label">Payment</div>
        <div class="data-value">Credit Card (Visa/Master)</div>
      </div>
    </div>
    <div class="logo">
      <svg
        xmlns="http://www.w3.org/2000/svg"
        width="124"
        height="28"
        viewBox="0 0 124 28"
        fill="none"
      >
        <path
          fill-rule="evenodd"
          clip-rule="evenodd"
          d="M84.5914 0H89.4806V27.7846H84.5914V0ZM124 11.7169V7.40923H118.984V1.80923H114.095V22.2708C114.095 24.1662 114.559 25.5877 115.486 26.5354C116.413 27.4831 117.804 27.9569 119.701 27.9569H124V23.6492H120.839C120.165 23.6492 119.659 23.4769 119.364 23.1754C119.111 22.9169 118.942 22.1846 118.942 21.4092V11.7169H124ZM51.5051 22.3569L56.5207 7.36615H61.6207L54.3712 27.7415H48.5969L41.3474 7.40923H46.4473L51.5051 22.3569ZM106.171 17.5754C106.171 18.8677 105.961 19.9877 105.623 20.8923C105.244 21.7969 104.696 22.5292 104.022 23.0031C103.347 23.4769 102.504 23.6923 101.535 23.6923C100.144 23.6923 99.0904 23.2185 98.416 22.3138C97.7417 21.3662 97.3623 19.9877 97.3623 18.1354V7.36615H92.4731V18.6523C92.4731 20.4185 92.6839 21.9262 93.1054 23.0892C93.5268 24.2954 94.1169 25.2431 94.8334 25.9754C95.55 26.7077 96.3929 27.2246 97.3623 27.5262C98.2896 27.8277 99.3012 28 100.355 28C101.872 28 103.137 27.6985 104.106 27.1815C104.991 26.6646 105.708 26.0615 106.298 25.4154L106.719 27.7846H110.976V7.40923H106.087V17.5754H106.171ZM77.1312 8.44308C75.6139 7.58154 73.7593 7.15077 71.7362 7.15077C69.7131 7.15077 67.9007 7.58154 66.3413 8.44308C64.7818 9.30462 63.5595 10.5538 62.7165 12.1046C61.8736 13.6554 61.4521 15.5077 61.4521 17.5754C61.4521 19.6431 61.8736 21.4523 62.7165 23.0031C63.5595 24.5538 64.7818 25.8031 66.3413 26.6646C67.9007 27.5262 69.7131 27.9569 71.7362 27.9569C73.8015 27.9569 75.6139 27.5262 77.1312 26.6646C78.6485 25.8031 79.8708 24.5538 80.7138 23.0031C81.5568 21.4523 81.9782 19.6 81.9782 17.5754C81.9782 15.5077 81.5568 13.6554 80.7138 12.1046C79.913 10.5538 78.6907 9.34769 77.1312 8.44308ZM74.5602 23.0031C73.7593 23.52 72.8321 23.7785 71.7362 23.7785C70.6404 23.7785 69.7131 23.52 68.9123 23.0031C68.1115 22.4862 67.4793 21.7538 67.0578 20.8062C66.6363 19.8585 66.3834 18.7815 66.3834 17.5754C66.3834 16.3262 66.5942 15.2492 67.0578 14.3446C67.4793 13.44 68.1115 12.6646 68.9123 12.1477C69.7131 11.6308 70.6404 11.3292 71.7362 11.3292C72.8321 11.3292 73.8015 11.5877 74.5602 12.1477C75.361 12.6646 75.951 13.44 76.4147 14.3446C76.8362 15.2492 77.0891 16.3692 77.0891 17.5754C77.0891 18.7815 76.8783 19.8585 76.4147 20.8062C75.9932 21.7538 75.361 22.4862 74.5602 23.0031ZM5.05778 6.84923H0V27.7415H5.05778V6.84923ZM20.9477 8.05538C20.9477 3.61846 17.4072 0 13.0659 0H0V4.48H12.4337C14.4147 4.48 16.0163 6.07385 16.0585 8.01231C16.0585 9.00308 15.7213 9.90769 15.0469 10.5969C14.3725 11.2431 13.4874 11.6308 12.5602 11.6308H7.71312C7.54453 11.6308 7.41808 11.76 7.41808 11.9323V15.9385C7.41808 16.0246 7.41808 16.0677 7.46023 16.1108L15.6791 27.7415H21.7063L13.4453 16.0677C17.5758 15.8954 20.9477 12.32 20.9477 8.05538ZM36.5003 8.35692C35.0252 7.58154 33.2971 7.15077 31.3583 7.15077C29.4194 7.15077 27.6492 7.58154 26.174 8.44308C24.6567 9.30462 23.5187 10.5538 22.6757 12.1046C21.8328 13.6554 21.4534 15.5077 21.4534 17.6185C21.4534 19.6862 21.8749 21.4954 22.7179 23.0462C23.5608 24.5969 24.7831 25.8462 26.3005 26.6646C27.86 27.5262 29.7145 27.9569 31.8219 27.9569C33.5078 27.9569 34.983 27.6554 36.2896 27.0092C37.5962 26.3631 38.6499 25.5015 39.4086 24.4246C40.1672 23.3908 40.673 22.2708 40.9259 21.0215L40.968 20.8923H36.0367L35.9946 20.9785C35.7417 21.9262 35.1937 22.6585 34.4772 23.1754C33.6764 23.7354 32.6649 24.0369 31.5269 24.0369C30.5574 24.0369 29.6723 23.8215 28.9137 23.3908C28.155 22.96 27.5649 22.3569 27.1434 21.6246C26.722 20.8492 26.5112 19.9446 26.4269 18.9108V18.7385H41.0523V18.6523C41.0945 18.3508 41.1366 18.0492 41.1366 17.7908C41.1366 17.4892 41.1366 17.2308 41.1366 16.9292C41.0945 14.9477 40.673 13.2246 39.8722 11.76C39.1135 10.2523 37.9334 9.13231 36.5003 8.35692ZM34.7301 12.1908C35.5731 12.9231 36.0789 13.9138 36.2896 15.2062H26.6377C26.7641 14.3877 27.017 13.6554 27.4385 13.0523C27.9021 12.4062 28.45 11.9323 29.1666 11.5877C29.8409 11.2431 30.5996 11.0708 31.4004 11.0708C32.7491 11.0708 33.845 11.4585 34.7301 12.1908Z"
          fill="currentColor"
        />
      </svg>
    </div>
  </div>
</div>

<!--
╭──────────────────────────────────────────────────────────────────────────────────╮
│ 🌊 Svelte Component CSS/SCSS                                                     │
┣──────────────────────────────────────────────────────────────────────────────────┫
│ ➤ HINT: │ auto-fill/auto-complete iniside <style> for var()                      │
│         │ values by typing/CTRL+SPACE                                            │
│ ➤ HINT: │ access custom Betarena Scores CSS VScode Snippets by typing 'style...' │
╰──────────────────────────────────────────────────────────────────────────────────╯
-->

<style lang="scss">
  .deposit-proccessor-wrapper {
    display: flex;
    flex-direction: column;
    align-items: flex-start;
    gap: var(--spacing-lg, 12px);
    align-self: stretch;
    width: 100%;

    .header {
      display: flex;
      flex-direction: column;
      align-items: flex-start;
      align-self: stretch;

      .title {
        color: var(--colors-text-text-primary-900, #fff);

        /* Text xl/Semibold */
        font-family: var(--font-family-font-family-body, Roboto);
        font-size: var(--font-size-text-xl, 20px);
        font-style: normal;
        font-weight: 600;
        line-height: var(--line-height-text-xl, 30px); /* 150% */
      }
    }
    .data-wrapper {
      display: flex;
      gap: var(--spacing-lg, 12px);
      width: 100%;
      justify-content: space-between;
      .data {
        display: flex;
        flex-grow: 1;
        flex-direction: column;
        align-items: flex-start;
        gap: var(--spacing-lg, 12px);
        .data-field {
          display: flex;
          flex-direction: column;
          align-items: flex-start;
          gap: 8px;
          align-self: stretch;
          .label {
            color: var(--colors-text-text-tertiary-600, #8c8c8c);

            /* Text sm/Medium */
            font-family: var(--font-family-font-family-body, Roboto);
            font-size: var(--font-size-text-sm, 14px);
            font-style: normal;
            font-weight: 500;
            line-height: var(--line-height-text-sm, 20px); /* 142.857% */
          }
          .data-value {
            color: var(--colors-text-text-primary-900, #fff);

            /* Text md/Semibold */
            font-family: var(--font-family-font-family-body, Roboto);
            font-size: var(--font-size-text-md, 16px);
            font-style: normal;
            font-weight: 600;
            line-height: var(--line-height-text-md, 24px); /* 150% */
          }
        }
      }
      .logo {
        color: var(--colors-foreground-fg-primary-900, #fff);
      }
    }

    &:not(.mobile) {
      .data {
        max-width: 359px;
        width: 100%;
      }
      .logo {
        flex-grow: 1;
        display: flex;
        justify-content: start;
      }
    }
  }
</style>
