// ╭──────────────────────────────────────────────────────────────────────────────────╮
// │ 📌 High Order Overview                                                           │
// ┣──────────────────────────────────────────────────────────────────────────────────┫
// │ ➤ Code Format   // V.8.0                                                         │
// │ ➤ Status        // 🔒 LOCKED                                                     │
// │ ➤ Author(s)     // @migbash                                                      │
// │ ➤ Maintainer(s) // @migbash                                                      │
// │ ➤ Created on    // 2025-11-10                                                    │
// ┣──────────────────────────────────────────────────────────────────────────────────┫
// │ 📝 Description                                                                   │
// ┣──────────────────────────────────────────────────────────────────────────────────┫
// │ BETARENA (envrionment)
// │ |: IMPORTANT :: SAFE TO COMMIT TO REPOSITORY
// │ |: Configuration for Betarena About Project
// ╰──────────────────────────────────────────────────────────────────────────────────╯

export const config = {
  // ╭─────
  // │ NOTE:
  // │ |: Configuration for Lazy Load Components in Application
  // ╰─────
  objApp:
  {
    listLazyLoadComponents: new Map
    (
      [
        // ╭──────────────────────────────────────────────────────────────────────────────────╮
        // │ 📌 │ LAYOUTS / PAGES                                                             │
        // ╰──────────────────────────────────────────────────────────────────────────────────╯
        [
          'src/routes/+layout.svelte',
          {
            isDynamicImport: false,
            isHidden: false,
          }
        ],
        [
          'src/routes/(authors)/a/[...permalink]/+page.svelte',
          {
            isDynamicImport: false,
            isHidden: false,
          }
        ],
      ]
    )
  },
}