// ╭──────────────────────────────────────────────────────────────────────────────────╮
// │ 📌 High Order Overview                                                           │
// ┣──────────────────────────────────────────────────────────────────────────────────┫
// │ ➤ Code Format   // V.8.0                                                         │
// │ ➤ Status        // 🔒 LOCKED                                                     │
// │ ➤ Author(s)     // @migbash                                                      │
// │ ➤ Maintainer(s) // @migbash                                                      │
// │ ➤ Created on    // 2025-11-10                                                    │
// ┣──────────────────────────────────────────────────────────────────────────────────┫
// │ 📝 Description                                                                   │
// ┣──────────────────────────────────────────────────────────────────────────────────┫
// │ BETARENA (envrionment)
// │ |: IMPORTANT :: SAFE TO COMMIT TO REPOSITORY
// │ |: Configuration for Betarena About Project
// ╰──────────────────────────────────────────────────────────────────────────────────╯

export const config = {
  // ╭─────
  // │ NOTE:
  // │ |: Configuration for Lazy Load Components in Application
  // ╰─────
  objApp:
  {
    listLazyLoadComponents: new Map
    (
      [
        // ╭──────────────────────────────────────────────────────────────────────────────────╮
        // │ 🤖 │ LAYOUTS / PAGES (SERVER)                                                    │
        // ┣──────────────────────────────────────────────────────────────────────────────────┫
        // │ ℹ️ set 'isSsr' to 'false' to disable 'Server-Side-Rendering' (no load()) on route│
        // │ │-> Affects SEO negatively & worsens lighthouse score                            │
        // │ ℹ️ set 'isCsr' to 'false' to disable 'Client-Side-Rendering' (no JS) on route    │
        // │ │-> Improves Performance for User (avg. 90 score on lighthouse performance)      │
        // ╰──────────────────────────────────────────────────────────────────────────────────╯
        [
          'src/routes/(authors)/a/[...permalink]/+page.server.ts',
          {
            objSveltekitOptions:
            {
              isSsr: true,
              isCsr: true,
              isPrerender: false,
            }
          }
        ],
        // ╭──────────────────────────────────────────────────────────────────────────────────╮
        // │ 📌 │ LAYOUTS / PAGES                                                             │
        // ╰──────────────────────────────────────────────────────────────────────────────────╯
        [
          'src/routes/+layout.svelte',
          {
            isDynamicImport: false,
            isHidden: false,
          }
        ],
        [
          'src/routes/(authors)/a/[...permalink]/+page.svelte',
          {
            isDynamicImport: false,
            isHidden: false,
          }
        ],
      ]
    )
  },
}