// ╭──────────────────────────────────────────────────────────────────────────────────╮
// │ 📌 High Order Overview                                                           │
// ┣──────────────────────────────────────────────────────────────────────────────────┫
// │ ➤ Code Format   // V.8.0                                                         │
// │ ➤ Status        // 🔒 LOCKED                                                     │
// │ ➤ Author(s)     // @migbash                                                      │
// │ ➤ Maintainer(s) // @migbash                                                      │
// │ ➤ Created on    // November 11th, 2025 3:18 PM                                   │
// ┣──────────────────────────────────────────────────────────────────────────────────┫
// │ 📝 Description                                                                   │
// ┣──────────────────────────────────────────────────────────────────────────────────┫
// │ BETARENA (Module)
// │ |: Vite plugin to determine SSR or CSR build phase for SvelteKit projects.
// ╰──────────────────────────────────────────────────────────────────────────────────╯

// #region ➤ 📦 Package Imports

import chalk from "chalk";
import { setSSR } from "./env.ts";

import type { PluginOption } from "vite";

// #endregion ➤ 📦 Package Imports

// #region ➤ 📌 VARIABLES

const
  /**
   * @description
   */
  strConsolePrefix = chalk.bgMagenta(`[_betarea.vite.plugin.sveltekit-ssr-or-csr-build]`)
;

// #endregion ➤ 📌 VARIABLES

export function sveltekitSsrOrCsrBuild
(
): PluginOption
{
  let
    isSsrBuild = false
  ;

  return {
    name: '_betarea.vite.plugin.sveltekit-ssr-or-csr-build',
    // enforce: 'pre',

    config
    (
      config
    )
    {
      if (config.build?.ssr)
        isSsrBuild = true;
      ;

      setSSR(config.build?.ssr);
    },

    buildStart
    (
    )
    {
      if (isSsrBuild)
        // [🐞]
        console.log
        (
          `
          ${strConsolePrefix}
          ╭──────────────────────────────────────────────────────────────────────────────────╮
          │ 🚨 SSR build phase
          ╰──────────────────────────────────────────────────────────────────────────────────╯
          `.replaceAll('  ','')
        );
      else
        // [🐞]
        console.log
        (
          `
          ${strConsolePrefix}
          ╭──────────────────────────────────────────────────────────────────────────────────╮
          │ 🚨 CSR build phase
          ╰──────────────────────────────────────────────────────────────────────────────────╯
          `.replaceAll('  ','')
        );
      ;
    },
  };
}