<!--
╭──────────────────────────────────────────────────────────────────────────────────╮
│ 🟦 Svelte Component JS/TS                                                        │
┣──────────────────────────────────────────────────────────────────────────────────┫
│ ➤ HINT: │ Access snippets for '<script> [..] </script>' those found in           │
│         │ '.vscode/snippets.code-snippets' via intellisense using 'doc'          │
╰──────────────────────────────────────────────────────────────────────────────────╯
-->

<script lang="ts">
  import {
    type DotLottie,
    DotLottieSvelte,
  } from "@lottiefiles/dotlottie-svelte";
  export let dotLottie: DotLottie | null = null;
  export let url: string | null = null;
</script>

<DotLottieSvelte
  dotLottieRefCallback={(ref) => (dotLottie = ref)}
  src={url}
  {...$$restProps}
/>
