// ╭──────────────────────────────────────────────────────────────────────────────────╮
// │ 📌 High Order Overview                                                           │
// ┣──────────────────────────────────────────────────────────────────────────────────┫
// │ ➤ Code Format   // V.8.0                                                         │
// │ ➤ Status        // 🔒 LOCKED                                                     │
// │ ➤ Author(s)     // @migbash                                                      │
// │ ➤ Maintainer(s) // @migbash                                                      │
// │ ➤ Created on    // 2024-08-29                                                    │
// ┣──────────────────────────────────────────────────────────────────────────────────┫
// │ 📝 Description                                                                   │
// ┣──────────────────────────────────────────────────────────────────────────────────┫
// │ BETARENA (Module)
// │ |: Middleware Entrypoint
// │ |: DOC: https://github.com/sveltejs/kit/tree/master/packages/adapter-node#custom-server
// ╰──────────────────────────────────────────────────────────────────────────────────╯

// #region ➤ 📦 Package Imports

import express from 'express';

// @ts-expect-error -- SvelteKit Adapter Node Handler
import { handler } from '../build/handler.js';

// #endregion ➤ 📦 Package Imports

// #region ➤ 📌 VARIABLES

// [🐞]
console.log(`🚏 checkpoint :: [server.local.testing.js] Spinning up Express (Middleware) Server`);

const
  /**
   * @description
   * 📝 express app declaration
   */
  app = express()
;

// [🐞]
console.log(`🔹 [var] :: VITE_HASURA_DB_TOKEN ${process.env?.VITE_HASURA_DB_TOKEN}`);

// #endregion ➤ 📌 VARIABLES

// ╭──────────────────────────────────────────────────────────────────╮
// │ 🛠️ │ INTIAILIZATION (MISC.)                                      │
// ╰──────────────────────────────────────────────────────────────────╯

// ╭─────
// │ NOTE: IMPORTANT CRITICAL
// │ |: Let SvelteKit handle everything else,
// │ |: including serving prerendered pages and static assets.
// ╰─────
app.use(handler);

// ╭──────────────────────────────────────────────────────────────────╮
// │ 🚀 │ APP SPIN-UP                                                 │
// ╰──────────────────────────────────────────────────────────────────╯

// [🐞]
console.log(`🚏 checkpoint :: [server.local.testing.js] Spinning up Production`);

app.listen
(
  3050,
  () =>
  {
    // [🐞]
    console.log(`🚏 checkpoint :: [server.local.testing.js] Server listening on port 3050`);
    return;
  }
);
