<!--
╭──────────────────────────────────────────────────────────────────────────────────╮
│ 🟦 Svelte Component JS/TS                                                        │
┣──────────────────────────────────────────────────────────────────────────────────┫
│ ➤ HINT: │ Access snippets for '<script> [..] </script>' those found in           │
│         │ '.vscode/snippets.code-snippets' via intellisense using 'doc'          │
╰──────────────────────────────────────────────────────────────────────────────────╯
-->

<script lang="ts">
  import TranslationText from "$lib/components/misc/Translation-Text.svelte";

  // #region ➤ 📌 VARIABLES

  // ╭────────────────────────────────────────────────────────────────────────╮
  // │ NOTE:                                                                  │
  // │ Please add inside 'this' region the 'variables' that are to be         │
  // │ and are expected to be used by 'this' .svelte file / component.        │
  // │ IMPORTANT                                                              │
  // │ Please, structure the imports as follows:                              │
  // │ 1. export const / let [..]                                             │
  // │ 2. const [..]                                                          │
  // │ 3. let [..]                                                            │
  // │ 4. $: [..]                                                             │
  // ╰────────────────────────────────────────────────────────────────────────╯

  export let vertlical = true,
    links,
    order = ["changelog", "status", "about", "terms", "roadmap", "privacy"];

  const /**
     * @description
     *  📣 `this` component **main** `id` and `data-testid` prefix.
     */ // eslint-disable-next-line no-unused-vars
    CNAME: string = "<section-scope>⮕<type|w|c>⮕<unique-tag-name>⮕main";

  // #endregion ➤ 📌 VARIABLES
</script>

<div class="navigation-block" class:vertlical>
  {#each order as id}
    {@const item = links.get(id)}
    {#if item}
      <a href={item?.href} rel="external">
        <TranslationText key={`${CNAME}/unknown`} text={item.label} />
      </a>
    {/if}
  {/each}
</div>

<!--
╭──────────────────────────────────────────────────────────────────────────────────╮
│ 🌊 Svelte Component CSS/SCSS                                                     │
┣──────────────────────────────────────────────────────────────────────────────────┫
│ ➤ HINT: │ auto-fill/auto-complete iniside <style> for var()                      │
│         │ values by typing/CTRL+SPACE                                            │
│ ➤ HINT: │ access custom Betarena Scores CSS VScode Snippets by typing 'style...' │
╰──────────────────────────────────────────────────────────────────────────────────╯
-->

<style lang="scss">
  .navigation-block {
    display: flex;
    gap: 32px;

    &.vertlical {
      display: grid;
      row-gap: 8px;
      grid-template-columns: auto auto;
      font-weight: 500;
    }

    a:hover {
      color: var(--primary);
    }
  }
</style>
