<!--
╭──────────────────────────────────────────────────────────────────────────────────╮
│ 🟦 Svelte Component JS/TS                                                        │
┣──────────────────────────────────────────────────────────────────────────────────┫
│ ➤ HINT: │ Access snippets for '<script> [..] </script>' those found in           │
│         │ '.vscode/snippets.code-snippets' via intellisense using 'doc'          │
╰──────────────────────────────────────────────────────────────────────────────────╯
-->

<script lang="ts">
    // #region ➤ 📦 Package Imports
    
    // ╭────────────────────────────────────────────────────────────────────────╮
    // │ NOTE:                                                                  │
    // │ Please add inside 'this' region the 'imports' that are required        │
    // │ by 'this' .svelte file is ran.                                         │
    // │ IMPORTANT                                                              │
    // │ Please, structure the imports as follows:                              │
    // │ 1. svelte/sveltekit imports                                            │
    // │ 2. project-internal files and logic                                    │
    // │ 3. component import(s)                                                 │
    // │ 4. assets import(s)                                                    │
    // │ 5. type(s) imports(s)                                                  │
    // ╰────────────────────────────────────────────────────────────────────────╯
    
    import Container from "$lib/components/ui/wrappers/Container.svelte";
    import img from "../assets/publish.png";
    
    // #endregion ➤ 📦 Package Imports
</script>

<!--
╭──────────────────────────────────────────────────────────────────────────────────╮
│ 💠 Svelte Component HTML                                                         │
┣──────────────────────────────────────────────────────────────────────────────────┫
│ ➤ HINT: │ Use 'Ctrl + Space' to autocomplete global class=styles, dynamically    │
│         │ imported from './static/app.css'                                       │
│ ➤ HINT: │ access custom Betarena Scores VScode Snippets by typing emmet-like     │
│         │ abbrev.                                                                │
╰──────────────────────────────────────────────────────────────────────────────────╯
-->

<div class="ready-to-publish">

    <img
        id=''
        src={img}
        alt='ready to publish'
        title=''
        loading='lazy'
    />
    <div class="text-wrapper">
        <Container></Container>
    </div>
</div>

<!--
╭──────────────────────────────────────────────────────────────────────────────────╮
│ 🌊 Svelte Component CSS/SCSS                                                     │
┣──────────────────────────────────────────────────────────────────────────────────┫
│ ➤ HINT: │ auto-fill/auto-complete iniside <style> for var()                      │
│         │ values by typing/CTRL+SPACE                                            │
│ ➤ HINT: │ access custom Betarena Scores CSS VScode Snippets by typing 'style...' │
╰──────────────────────────────────────────────────────────────────────────────────╯
-->

<style lang="scss">
  .ready-to-publish {
    height: 100%;
    width: 100%;
    display: flex;
    flex-direction: column;
    position: relative;
    justify-content: flex-end;

    img {
        position: absolute;
        top: 0;
        width: 100%;
        left: 0;
    }
    .text-wrapper {
        :global(.container-wrapper) {
            padding-top:  54px;
            padding-bottom: 24px;
        }
    }
  }
</style>
