<!--
╭──────────────────────────────────────────────────────────────────────────────────╮
│ Svelte Component JS/TS                                                           │
┣──────────────────────────────────────────────────────────────────────────────────┫
│ - access custom Betarena Scores JS VScode Snippets by typing 'script...'         │
╰──────────────────────────────────────────────────────────────────────────────────╯
-->

<script lang="ts">

  // #region ➤ 📦 Package Imports

  // ╭────────────────────────────────────────────────────────────────────────╮
  // │ NOTE:                                                                  │
  // │ Please add inside 'this' region the 'imports' that are required        │
  // │ by 'this' .svelte file is ran.                                         │
  // │ IMPORTANT                                                              │
  // │ Please, structure the imports as follows:                              │
  // │ 1. svelte/sveltekit imports                                            │
  // │ 2. project-internal files and logic                                    │
  // │ 3. component import(s)                                                 │
  // │ 4. assets import(s)                                                    │
  // │ 5. type(s) imports(s)                                                  │
  // ╰────────────────────────────────────────────────────────────────────────╯

	import userBetarenaSettings from '$lib/store/user-settings.js';

  import Footer from '$lib/components/_main_/footer/Footer.svelte';
  import HeaderWidget from '$lib/components/_main_/header/authors/Header-Widget.svelte';
  import SplashScreen from '$lib/components/Splash-Screen.svelte';

  // #endregion ➤ 📦 Package Imports

</script>

<!--
╭──────────────────────────────────────────────────────────────────────────────────╮
│ Svelte Component HTML                                                            │
┣──────────────────────────────────────────────────────────────────────────────────┫
│ - use 'Ctrl+Space' to autocomplete global class=styles                           │
│ - access custom Betarena Scores VScode Snippets by typing emmet-like abbrev.     │
╰──────────────────────────────────────────────────────────────────────────────────╯
-->

<SplashScreen />

<HeaderWidget />

<main
  class:dark-mode={$userBetarenaSettings.theme == 'Dark'}
>
  <slot/>
</main>

<Footer />

<!--
╭──────────────────────────────────────────────────────────────────────────────────╮
│ Svelte Component CSS/SCSS                                                        │
┣──────────────────────────────────────────────────────────────────────────────────┫
│ - auto-fill/auto-complete iniside <style> for var() values by typing/CTRL+SPACE  │
│ - access custom Betarena Scores CSS VScode Snippets by typing 'style...'         │
╰──────────────────────────────────────────────────────────────────────────────────╯
-->

<style lang="scss">

  // IMPORTANT
  :global
  {
    body
    {
      &:has(main)
      {
        /* 🎨 style */
        background-color: var(--white);
      }
      &:has(main.dark-mode)
      {
        /* 🎨 style */
        background-color: var(--dark-theme);
      }
    }
  }

  main
  {
    /* 🎨 style */
    background-color: var(--white);
    margin: auto;
    max-width: 836px;

    &.dark-mode
    , body:has(&.dark-mode)
    {
      /* 🎨 style */
      background-color: var(--dark-theme);
    }
  }

</style>
