#!/bin/sh

# ╭──────────────────────────────────────────────────────────────────────────────────╮
# │ 📌 High Order Overview                                                           │
# ┣──────────────────────────────────────────────────────────────────────────────────┫
# │ ➤ Code Format   // V.8.0                                                         │
# │ ➤ Status        // 🔒 LOCKED                                                     │
# │ ➤ Author(s)     // @migbash                                                      │
# │ ➤ Maintainer(s) // @migbash                                                      │
# │ ➤ Created on    // November 26th, 2025.                                          │
# ┣──────────────────────────────────────────────────────────────────────────────────┫
# │ 📝 Description                                                                   │
# ┣──────────────────────────────────────────────────────────────────────────────────┫
# │ BETARENA (Module)
# ╰──────────────────────────────────────────────────────────────────────────────────╯

strDebugPrefix="[docker.scores.build.check.sh]"

# [🐞]
echo "$strDebugPrefix ────────────────────────────────────────────────────────────────"
# [🐞]
echo "$strDebugPrefix // START"

# [🐞]
echo "$strDebugPrefix Number of files in build.copy ::" $(ls -R build.copy | wc -l)
# [🐞]
echo "$strDebugPrefix Number of files changed between build and build.copy ::" $(diff -qr build build.copy | wc -l)
# [🐞]
diff -qr build build.copy

# [🐞]
echo "$strDebugPrefix // END"
