#!/bin/sh

# ╭──────────────────────────────────────────────────────────────────────────────────╮
# │ 📌 High Order Overview                                                           │
# ┣──────────────────────────────────────────────────────────────────────────────────┫
# │ ➤ Code Format   // V.8.0                                                         │
# │ ➤ Status        // 🔒 LOCKED                                                     │
# │ ➤ Author(s)     // @migbash                                                      │
# │ ➤ Maintainer(s) // @migbash                                                      │
# │ ➤ Created on    // 03-12-2024                                                    │
# ┣──────────────────────────────────────────────────────────────────────────────────┫
# │ 📝 Description                                                                   │
# ┣──────────────────────────────────────────────────────────────────────────────────┫
# │ BETARENA (Module)
# ╰──────────────────────────────────────────────────────────────────────────────────╯

strDebugPrefix="[docker.static.update.sh]"
strDockerContainer=betarena-scores-scores-production-1
strStaticDirectory=./.docker/scores.production/static

# [🐞]
echo "$strDebugPrefix ────────────────────────────────────────────────────────────────"

# ╭─────
# │ NOTE:
# │ |: loop through all the files listed in the runtime-config-files.txt
# ╰─────
for strFilePath in $(find $strStaticDirectory -type f); do

  echo "🔹 processing :: $strFilePath"

  strFilePathInsideContainer="${strFilePath/'./.docker/scores.production/static/'/'build/client/'}"

  echo "💽 persisting :: $strFilePathInsideContainer"

  docker cp \
    $strFilePath \
    $strDockerContainer:"/app/$strFilePathInsideContainer"
  #

  echo ""
done

# [🐞]
echo "$strDebugPrefix ────────────────────────────────────────────────────────────────"
