#!/bin/sh

# ╭──────────────────────────────────────────────────────────────────────────────────╮
# │ 📌 High Order Overview                                                           │
# ┣──────────────────────────────────────────────────────────────────────────────────┫
# │ ➤ Code Format   // V.8.0                                                         │
# │ ➤ Status        // 🔒 LOCKED                                                     │
# │ ➤ Author(s)     // @migbash                                                      │
# │ ➤ Maintainer(s) // @migbash                                                      │
# │ ➤ Created on    // November 29th, 2025                                           │
# ┣──────────────────────────────────────────────────────────────────────────────────┫
# │ 📝 Description                                                                   │
# ┣──────────────────────────────────────────────────────────────────────────────────┫
# │ BETARENA (Module)
# │ │: Docker entrypoint script for 'scores-build' service.
# ╰──────────────────────────────────────────────────────────────────────────────────╯

strDebugPrefix="[docker.scores.build.entrypoint.sh]"

# [🐞]
echo "$strDebugPrefix ────────────────────────────────────────────────────────────────"
# [🐞]
echo "$strDebugPrefix 🛠️  starting 'scores-build' service"

source ./.scripts/docker.scores.build.check.sh

# [🐞]
echo "$strDebugPrefix preparing build files for environment injection..."

# ╭─────
# │ NOTE: CRITICAL
# │ |: clean previous 'build/*' files (& docker-volume) and copy fresh build files.
# ╰─────
rm -rf ./build/*
cp -R ./build.copy/* ./build/

source ./.scripts/docker.scores.build.check.sh

# ╭─────
# │ NOTE: CRITICAL
# │ |: inject environment variables into 'build/*' files.
# ╰─────
source ./.scripts/docker.scores.build.env.inject.sh

source ./.scripts/docker.scores.build.check.sh