<!--
╭──────────────────────────────────────────────────────────────────────────────────╮
│ 🟦 Svelte Component JS/TS                                                        │
┣──────────────────────────────────────────────────────────────────────────────────┫
│ ➤ HINT: │ Access snippets for '<script> [..] </script>' those found in           │
│         │ '.vscode/snippets.code-snippets' via intellisense using 'doc'          │
╰──────────────────────────────────────────────────────────────────────────────────╯
-->

<script lang="ts">
  import ImgPlaceholder from "$lib/components/ui/assets/img-placeholder.svelte";

  export let avatar = "";
  export let size = "74px";

  $: avatarSize = `height: ${size}; width: ${size};`;
</script>

{#if avatar}
  <div class="img" style="--img-url: url({avatar}); {avatarSize}" />
{:else}
  <div class="img empty" style="{avatarSize}">
    <ImgPlaceholder />
  </div>
{/if}

<!--
╭──────────────────────────────────────────────────────────────────────────────────╮
│ 🌊 Svelte Component CSS/SCSS                                                     │
┣──────────────────────────────────────────────────────────────────────────────────┫
│ ➤ HINT: │ auto-fill/auto-complete iniside <style> for var()                      │
│         │ values by typing/CTRL+SPACE                                            │
│ ➤ HINT: │ access custom Betarena Scores CSS VScode Snippets by typing 'style...' │
╰──────────────────────────────────────────────────────────────────────────────────╯
-->

<style lang="scss">
  .img {
    width: 74px;
    height: 74px;
    flex-shrink: 0;

    border-radius: var(--radius-sm, 6px);
    background: var(--img-url) lightgray 50% / cover no-repeat;

    &.empty {
      background-color: var(--colors-background-bg-quaternary, #525252);
      display: flex;
      align-items: center;
      justify-content: center;
      :global(svg path) {
        stroke: var(--colors-foreground-fg-secondary-700) !important;
      }
    }
  }
</style>
